Revit 2027 API
ParameterTypeId.FabricationPartLengthOption Property
 "Length Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartLengthOption { get; }
Public Shared ReadOnly Property FabricationPartLengthOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartLengthOption {
	ForgeTypeId^ get ();
}
static member FabricationPartLengthOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace